<?php
return [
    // +----------------------------------------------------------------------
    // | 基础配置
    // +----------------------------------------------------------------------
    //
    'debug'            => true, // 是否开启调试
    'trace'            => true, // 是否显示页面Trace信息
    'app_debug'        => true, // app接口调试模式
    'error_log'        => true, // 错误日志保存 true保存 false不保存

    'check_disk'       => true, // 是否开启磁盘容量检测

    'db_file'          => 'db.php', // 数据库配置文件名称

    'auth_key'         => 'test123456', // 助手函数auth密钥 用于可逆加密[注意手动修改这个值]

    'help_paths'       => [VENDOR_PATH . 'denha' . DS . 'framework' . DS . 'helper.php'], // 助手函数存放地址

    // +----------------------------------------------------------------------
    // | 项目结构层数配置
    // | level
    // |    ture:开启项目结构
    // |    false:关闭项目结构目录
    // | 关闭后取SCRIPT_NAME 最后一个为Action 倒数第二个为Controller 参数/s区分
    // +----------------------------------------------------------------------
    //
    'route'            => [
        'level'        => 3, // 项目结构层数数量
        'open_level'   => true,
        'open_route'   => true, // 是否开启路由转换功能 true开启 false关闭
        'old_uri_hide' => false, // 当开启路由转换后是否禁止原路由访问 false:不禁止 true:禁止
        'route_files'  => [CONFIG_PATH . 'route.php'], // 路由规则存放地址
        'type'         => 'sqlite', // 保存类型
    ],

    // +----------------------------------------------------------------------
    // | Session配置
    // +----------------------------------------------------------------------
    //
    'session'          => [
        'type'       => 'files', // files=>文件存放 redis=>redis存放
        'prefix'     => 'dh_', // SESSION 前缀
        'auto_start' => 1, // 是否自动开启 SESSION 1:启动 0:不自动启动
        'expire'     => 1440, // session过期时间
        // 驱动配置
        'drive'      => [
            [
                'host'     => '127.0.0.1', // tcp链接地址
                'port'     => 6379, // 端口
                'password' => '', // 密码
            ],
        ],
    ],

    // +----------------------------------------------------------------------
    // | Cookie配置
    // +----------------------------------------------------------------------
    //
    'cookie'           => [
        // Cookie 作用域
        'domain' => '',
        // Cookie 作用路径
        'path'   => '/',
        // Cookie 前缀，同一域名下安装多套系统时，请修改Cookie前缀
        'prefix' => 'dh_',
        // Cookie 保存时间
        'expire' => 0,
        // Cookie 内容加密
        'auth'   => true,
    ],

    // +----------------------------------------------------------------------
    // | 错误信息配置
    // +----------------------------------------------------------------------
    //
    'error'            => [
        'tpl'       => FARM_PATH . DS . 'trace' . DS . '404.html', // 错误屏蔽后显示模板信息
        'save_log'  => true, // 错误屏蔽后是否保存错误信息
        'save_days' => 0, // 最大保存天数 0则不限制
        'level'     => ['debug', 'info', 'notice', 'warning', 'error', 'critical', 'alert', 'emergency'], // 日志记录类型
    ],

    // +----------------------------------------------------------------------
    // | 缓存配置
    // +----------------------------------------------------------------------
    //
    'cache'            => [
        'Default' => [
            'type' => 'File',
            'path' => DATA_CACHE_PATH,
            'ttl'  => 3600,
        ]
    ],

    // +----------------------------------------------------------------------
    // | 视图模板替换字符串
    // +----------------------------------------------------------------------
    //
    'view_replace_str' => [
        '__PUBLIC__' => '',

    ],

    // +----------------------------------------------------------------------
    // | CORS配置
    // +----------------------------------------------------------------------
    //
    'cores'            => [
        // 开启状态
        'open'        => false,
        // 允许请求来源 多个来源请用数组表示
        'origin'      => '*',
        // GET,POST,PUT,DELETE
        'methods'     => ['GET', 'POST'],
        // 秒
        'maxAge'      => 1800,
        // 携带证书式访问保存cookie [当值为ture时origin不能为*]
        'credentials' => false,
    ],

];
